src/InformationRegisters/SharedUsers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>SharedUsers</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SequenceNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>InfobaseUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Users.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Users</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>InfoBaseUserID</Name>
					<Comment>It is required for mapping of the Users catalog item to the IB user</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NotValid</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberNumberCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ServerInfoBaseAdministrationSettings/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Skipping the initialization to guarantee that the form will be received if the SelfTest parameter is passed.
	If Parameters.Property("SelfTest") Then
		Return;
	EndIf;
	
	If CommonUse.FileInfoBase() Then
		Raise NStr("en = 'Configuring the server infobase is possible only in the client/server mode.'");
		Return;
	EndIf;
		
	AdministrationParameters = InfoBaseConnections.GetInfoBaseAdministrationParameters();
	
	InfoBaseUser = InfoBaseUsers.FindByName(
		AdministrationParameters.InfoBaseAdministratorName);
	If InfoBaseUser <> Undefined Then
		InfoBaseAdministratorID = InfoBaseUser.UUID;
	EndIf;
	
	If CommonUseCached.DataSeparationEnabled() Then
		Items.OperatingMode.CurrentPage = Items.DataSeparation;
		SharedInfoBaseAdministrator = String(InfoBaseAdministratorID);
		ChoiceList = Items.SharedInfoBaseAdministrator.ChoiceList;
		ChoiceList.Clear();
		Administrators = InformationRegisters.SharedUsers.AdministratorList();
		For Each ListItem In Administrators Do
			ChoiceList.Add(String(ListItem.Value), ListItem.Presentation);
		EndDo;
	Else
		Items.OperatingMode.CurrentPage = Items.NoDataSeparation;
		Users.FindAmbiguousInfoBaseUsers(, InfoBaseAdministratorID);
		InfoBaseAdministrator	= Catalogs.Users.FindByAttribute("InfoBaseUserID", InfoBaseAdministratorID);
	EndIf;
	InfoBaseAdministratorPassword		 = AdministrationParameters.InfoBaseAdministratorPassword;
	
	ClusterAdministratorName	 = AdministrationParameters.ClusterAdministratorName;
	ClusterAdministratorPassword = AdministrationParameters.ClusterAdministratorPassword;
	ServerAgentPort			 = AdministrationParameters.ServerAgentPort;
	ServerClusterPort		 = AdministrationParameters.ServerClusterPort;
	
	NonstandardPorts			 = ServerClusterPort <> 0 Or ServerAgentPort <> 0;
	ClusterRequiresAuthorization	 = Not IsBlankString(ClusterAdministratorName);
		
	Items.PortsGroup.Enabled = NonstandardPorts;
	Items.ClusterAuthorizationGroup.Enabled = ClusterRequiresAuthorization;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, AttributesToCheck)
	
	If CommonUseCached.DataSeparationEnabled() Then
		If IsBlankString(SharedInfoBaseAdministrator) Then
			Return;
		EndIf;
		FieldName = "SharedInfoBaseAdministrator";
	Else
		If Not ValueIsFilled(InfoBaseAdministrator) Then
			Return;
		EndIf;
		FieldName = "InfoBaseAdministrator";
	EndIf;
	InfoBaseUser = GetInfoBaseAdministrator();
	If InfoBaseUser = Undefined Then
		CommonUseClientServer.MessageToUser(NStr("en = 'The specified user cannot access the infobase.'"),,
			FieldName,,Cancel);
		Return;
	EndIf;
	If Not Users.InfoBaseUserWithFullAccess(InfoBaseUser, True) Then
		CommonUseClientServer.MessageToUser(NStr("en = 'The user does not have administrative rights.'"),,
			FieldName,,Cancel);
		Return;
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM HEADER ITEM EVENT HANDLERS

&AtClient
Procedure ClusterRequiresAuthorizationOnChange(Item)
	
	SetAccessibilityOfFormItems()
	
EndProcedure

&AtClient
Procedure NonstandardPortsOnChange(Item)
	
	SetAccessibilityOfFormItems();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// FORM HEADER ITEM EVENT HANDLERS

&AtClient
Procedure Write(Command)
	
	ClearMessages();
	If Not SaveConnectionParameters() Then
		Return;
	EndIf;							
	
	Notify("Write_InfoBaseAdministrationParameters");
	Close();
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// INTERNAL PROCEDURES AND FUNCTIONS

&AtClient
Procedure SetAccessibilityOfFormItems()
	
	Items.PortsGroup.Enabled = NonstandardPorts;
	Items.ClusterAuthorizationGroup.Enabled = ClusterRequiresAuthorization;
	
EndProcedure

&AtServer
Function SaveConnectionParameters()
	
	If Not CheckFilling() Then
		Return False;	
	EndIf;
		
	AdministrationParameters = InfoBaseConnections.GetInfoBaseAdministrationParameters();
		
	InfoBaseUser = GetInfoBaseAdministrator();
	If InfoBaseUser <> Undefined Then
		InfoBaseAdministratorName = InfoBaseUser.Name;
	Else	
		InfoBaseAdministratorName = "";
	EndIf;
	AdministrationParameters.InfoBaseAdministratorName = InfoBaseAdministratorName;
	AdministrationParameters.InfoBaseAdministratorPassword = InfoBaseAdministratorPassword;
	
	If ClusterRequiresAuthorization Then
		AdministrationParameters.ClusterAdministratorName = ClusterAdministratorName;
		AdministrationParameters.ClusterAdministratorPassword = ClusterAdministratorPassword;
	Else	
		AdministrationParameters.ClusterAdministratorName = "";
		AdministrationParameters.ClusterAdministratorPassword = "";
	EndIf;
	
	If NonstandardPorts Then
		AdministrationParameters.ServerClusterPort = ServerClusterPort;
		AdministrationParameters.ServerAgentPort = ServerAgentPort;
	Else	
		AdministrationParameters.ServerClusterPort = 0;
		AdministrationParameters.ServerAgentPort = 0;
	EndIf;	
	
	InfoBaseConnections.WriteInfoBaseAdministrationParameters(AdministrationParameters);
	
	Return True;
	
EndFunction

Function GetInfoBaseAdministrator()
	If CommonUseCached.DataSeparationEnabled() Then
		If IsBlankString(SharedInfoBaseAdministrator) Then
			Return Undefined;
		EndIf;
		Return InfoBaseUsers.FindByUUID(
			New UUID(SharedInfoBaseAdministrator));
	Else
		If Not ValueIsFilled(InfoBaseAdministrator) Then
			Return Undefined;
		EndIf;
		Return InfoBaseUsers.FindByUUID(
			InfoBaseAdministrator.InfoBaseUserID);
	EndIf;
EndFunction
